[
  {
    "i": 1,
    "title": "AI 2041",
    "language": "en",
    "author": "Kai-Fu Lee",
    "cover": "https://m.media-amazon.com/images/I/41KKYKTtUmL.jpg",
    "overview": "How will artificial intelligence change our world within twenty years? A WALL STREET JOURNAL, WASHINGTON POST, AND FINANCIAL TIMES BEST BOOK OF THE YEAR • “This inspired collaboration between a pioneering technologist and a visionary writer of science fiction offers bold and urgent insights.”—Yann LeCun, winner of the Turing Award; chief AI scientist, Facebook “Amazingly entertaining . . . Lee and Chen take us on an immersive trip through the future. . . . Eye-opening.”—Mark Cuban",
    "description": "AI will be the defining development of the twenty-first century. Within two decades, aspects of daily human life will be unrecognizable. AI will generate unprecedented wealth, revolutionize medicine and education through human-machine symbiosis, and create brand-new forms of communication and entertainment. In liberating us from routine work, however, AI will also challenge the organizing principles of our economic and social order. Meanwhile, AI will bring new risks in the form of autonomous weapons and smart technology that inherits human bias. AI is at a tipping point, and people need to wake up—both to AI’s radiant pathways and its existential perils for life as we know it. In this provocative, utterly original work, Kai-Fu Lee, the former president of Google China and bestselling author of AI Superpowers, teams up with celebrated novelist Chen Qiufan to imagine our world in 2041 and how it will be shaped by AI. In ten gripping short stories, they introduce readers to an array of eye-opening 2041 settings, such as: • In San Francisco, the “job reallocation” industry emerges as deep learning AI causes widespread job displacement • In Tokyo, a music fan is swept up in an immersive form of celebrity worship based on virtual reality and mixed reality • In Mumbai, a teenage girl rebels when AI’s crunching of big data gets in the way of romance • In Seoul, virtual companions with perfected natural language processing (NLP) skills offer orphaned twins new ways to connect • In Munich, a rogue scientist draws on quantum computing, computer vision and other AI technologies in a revenge plot that imperils the world By gazing toward a not-so-distant horizon, AI 2041 offers urgent insights into our collective future—while reminding readers that, ultimately, humankind remains the author of its destiny.",
    "publisher": "Currency",
    "publication_date": "September 14, 2021",
    "last_price": 30,
    "discount": 41,
    "quantity": 1000,
    "pages_count": 452,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a4398",
    "average_rating": 5,
    "sub_category": "61f84cf43c4594f1d2f692a5"
  },
  {
    "i": 2,
    "title": "Codependent No More",
    "language": "en",
    "author": "Melody Beattie",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41VErOJr-KL._SX319_BO1,204,203,200_.jpg",
    "overview": "Is someone else's problem your problem? If, like so many others, you've lost sight of your own life in the drama of tending to someone else's, you may be codependent--and you may find yourself in this book. The healing touchstone of millions, this modern classic by one of America's best-loved and most inspirational authors holds the key to understanding codependency and to unlocking its stultifying hold on your life.",
    "description": "Is someone else's problem your problem? If, like so many others, you've lost sight of your own life in the drama of tending to someone else's, you may be codependent--and you may find yourself in this book. The healing touchstone of millions, this modern classic by one of America's best-loved and most inspirational authors holds the key to understanding codependency and to unlocking its stultifying hold on your life. With instructive life stories, personal reflections, exercises, and self-tests, Codependent No More is a simple, straightforward, readable map of the perplexing world of codependency--charting the path to freedom and a lifetime of healing, hope, and happiness. Melody Beattie is the author of Beyond Codependency, The Language of Letting Go, Stop Being Mean to Yourself, and Playing It by Heart.",
    "publisher": "Hazelden",
    "publication_date": "January 1, 1986",
    "last_price": 15.95,
    "discount": 19,
    "quantity": 1000,
    "pages_count": 229,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a4399",
    "average_rating": 4,
    "sub_category": "61f84cf43c4594f1d2f692ab"
  },
  {
    "i": 3,
    "title": "Quicksilver",
    "language": "en",
    "author": "Dean Koontz",
    "cover": "https://m.media-amazon.com/images/I/51izX-4Y7gL.jpg",
    "overview": "#1 New York Times bestselling master of suspense Dean Koontz takes a surprising and exhilarating road trip with a man in pursuit of his strange past—mile by frightening mile.",
    "description": "Quinn Quicksilver was born a mystery—abandoned at three days old on a desert highway in Arizona. Raised in an orphanage, never knowing his parents, Quinn had a happy if unexceptional life. Until the day of “strange magnetism.” It compelled him to drive out to the middle of nowhere. It helped him find a coin worth a lot of money. And it practically saved his life when two government agents showed up in the diner in pursuit of him. Now Quinn is on the run from those agents and who knows what else, fleeing for his life. During a shoot-out at a forlorn dude ranch, he finally meets his destined companions: Bridget Rainking, a beauty as gifted in foresight as she is with firearms, and her grandpa Sparky, a romance novelist with an unusual past. Bridget knows what it’s like to be Quinn. She’s hunted, too. The only way to stay alive is to keep moving. Barreling through the Sonoran Desert, the formidable trio is impelled by that same inexplicable magnetism toward the inevitable. With every deeply disturbing mile, something sinister is in the rearview—an enemy that is more than a match for Quinn. Even as he discovers within himself resources that are every bit as scary.",
    "publisher": "Thomas & Mercer",
    "publication_date": "January 25, 2022",
    "last_price": 28.99,
    "discount": 70,
    "quantity": 1000,
    "pages_count": 365,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a439a",
    "average_rating": 3,
    "sub_category": "61f84cf43c4594f1d2f692b0"
  },
  {
    "i": 4,
    "title": "Blood in the Garden",
    "language": "en",
    "author": "Chris Herring",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51LUAlHNXoL._SX329_BO1,204,203,200_.jpg",
    "overview": "The definitive history of the 1990s New York Knicks, illustrating how Pat Riley, Patrick Ewing, John Starks, Charles Oakley, and Anthony Mason resurrected the iconic franchise through oppressive physicality and unmatched grit.",
    "description": "For nearly an entire generation, the New York Knicks have been a laughingstock franchise. Since 2001, they’ve spent more money, lost more games, and won fewer playoff series than any other NBA team. But during the preceding era, the Big Apple had a club it was madly in love with—one that earned respect not only by winning, but through brute force. The Knicks were always looking for fights, often at the encouragement of Pat Riley. They fought opposing players. They fought each other. Hell, they even occasionally fought their own coaches. The NBA didn’t take kindly to their fighting spirit. Within two years, league officials moved to alter several rules to stop New York from turning its basketball games into bloody mudwrestling matches. Nevertheless, as the 1990s progressed, the Knicks endeared themselves to millions of fans; not for how much they won, but for their colorful cast of characters and their hardworking mentality.",
    "publisher": "Atria Books",
    "publication_date": "January 18, 2022",
    "last_price": 28.99,
    "discount": 32,
    "quantity": 1000,
    "pages_count": 368,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a439b",
    "average_rating": 2,
    "sub_category": "61f84cf43c4594f1d2f692b4"
  },
  {
    "i": 5,
    "title": "The Horsewoman",
    "language": "en",
    "author": "James Patterson",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41ODD4pTzRL._SX323_BO1,204,203,200_.jpg",
    "overview": "Emotions rule us all—and turn two women’s lives into a ride they can barely control in this “hugely entertaining, riveting page-turner.” —#1 bestselling author Louise Penny",
    "description": "Maggie Atwood and Becky McCabe, mother and daughter, both champion riders, vowed to never, ever, go up against one another. Until the tense, harrowing competitions leading to the Paris Olympics. Mother and daughter share a dream: to be the best horsewoman in the world. Coronado is Maggie’s horse. An absolutely top-tier Belgian warmblood. Sky is Becky’s horse. A small, speedy Dutch warmblood. Only James Patterson could bring you such breakneck speed, hair-raising thrills and spills. Only hall of fame sportswriter Mike Lupica could make it all so real.",
    "publisher": "Little, Brown and Company",
    "publication_date": "January 10, 2022",
    "last_price": 28,
    "discount": 35,
    "quantity": 1000,
    "pages_count": 448,
    "tags": ["#1 New Release"],
    "category": "61f84eb1dc1d9702913a439c",
    "average_rating": 1,
    "sub_category": "61f84cf43c4594f1d2f692b9"
  },
  {
    "i": 6,
    "title": "Deep Sleep",
    "language": "en",
    "author": "Steven Konkoly",
    "cover": "https://m.media-amazon.com/images/I/41cSSjZRfwS._SY346_.jpg",
    "overview": "Stopping the most dangerous conspiracy to ever threaten America means believing the unthinkable in an explosive novel by Wall Street Journal bestselling author Steven Konkoly.",
    "description": "Countersurveillance expert Devin Gray is unwittingly thrown headfirst into dangerous new territory after the death of his mother. Helen Gray, a paranoid and disgraced former CIA officer, believed she was on the verge of preventing a national catastrophe—a mission worth dying for. Others, including Devin, believe she was chasing delusions. Until he finds what she left behind. With the help of longtime friend and former Marine helicopter pilot Marnie Young and a loyal team of covert operatives Helen summoned just before her death, Devin is propelled into a high-stakes chase across the country. What he uncovers, clue by clue, is a conspiracy more widespread and insidious than anyone could have imagined. Now it’s Devin’s mission to destroy a covert network poised to deliver a fatal blow to the future of the United States. And also to vindicate his mother, by seeing the mission through to its treacherous end.",
    "publisher": "Thomas & Mercer",
    "publication_date": "February 1, 2022",
    "last_price": 5,
    "discount": 0,
    "quantity": 1000,
    "pages_count": 365,
    "category": "61f84eb1dc1d9702913a439d",
    "average_rating": 5,
    "sub_category": "61f84cf43c4594f1d2f692be"
  },
  {
    "i": 7,
    "title": "The Body",
    "language": "en",
    "author": "Bill Bryson",
    "cover": "https://m.media-amazon.com/images/I/41x7d5KZiOL.jpg",
    "overview": "NEW YORK TIMES BESTSELLER • Bill Bryson, bestselling author of A Short History of Nearly Everything, takes us on a head-to-toe tour of the marvel that is the human body—with a new afterword for this edition.",
    "description": "Bill Bryson once again proves himself to be an incomparable companion as he guides us through the human body—how it functions, its remarkable ability to heal itself, and (unfortunately) the ways it can fail. Full of extraordinary facts (your body made a million red blood cells since you started reading this) and irresistible Brysonesque anecdotes, The Body will lead you to a deeper understanding of the miracle that is life in general and you in particular. As Bill Bryson writes, “We pass our existence within this wobble of flesh and yet take it almost entirely for granted.” The Body will cure that indifference with generous doses of wondrous, compulsively readable facts and information. As addictive as it is comprehensive, this is Bryson at his very best, a must-read owner’s manual for every body.",
    "publisher": "Anchor",
    "publication_date": "October 15, 2019",
    "last_price": 17,
    "discount": 90,
    "quantity": 1000,
    "pages_count": 478,
    "category": "61f84eb1dc1d9702913a439e",
    "average_rating": 4,
    "sub_category": "61f84cf43c4594f1d2f692c3"
  },
  {
    "i": 8,
    "title": "Continuous Discovery Habits",
    "language": "en",
    "author": "Teresa Torres",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41O-IVvXtmS._SX331_BO1,204,203,200_.jpg",
    "overview": "If you haven't had the good fortune to be coached by a strong leader or product coach, this book can help fill that gap and set you on the path to success.",
    "description": "How do you know that you are making a product or service that your customers want? How do you ensure that you are improving it over time? How do you guarantee that your team is creating value for your customers in a way that creates value for your business? In this book, you'll learn a structured and sustainable approach to continuous discovery that will help you answer each of these questions, giving you the confidence to act while also preparing you to be wrong. You'll learn to balance action with doubt so that you can get started without being blindsided by what you don't get right. If you want to discover products that customers love-that also deliver business results-this book is for you.",
    "publisher": "Product Talk LLC",
    "publication_date": "April 14, 2021",
    "last_price": 19.99,
    "discount": 8,
    "quantity": 1000,
    "pages_count": 244,
    "category": "61f84eb1dc1d9702913a4398",
    "average_rating": 3,
    "sub_category": "61f84cf43c4594f1d2f692a6"
  },
  {
    "i": 9,
    "title": "Knee Ability Zero",
    "language": "en",
    "author": "Ben Patrick",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41Z51ijeLmL._SX331_BO1,204,203,200_.jpg",
    "overview": "Question: What can a guy who couldn’t run fast, couldn’t jump high and had debilitating knee pain and injuries teach you about becoming your happiest and healthiest you? Answer: Zero. As in, Knee Ability Zero.",
    "description": "The Zero actually refers to zero weights, zero gym memberships and zero athletic ability needed to make dramatic gains in your overall health and fitness. All you need is THIS BOOK. Author Ben Patrick - aka #kneesovertoesguy - started out as something of an athletic zero. Sure, he was a good basketball player fundamentally, but his 19-inch vertical was laughable, and his time in the 40-yard dash was so tortoise-like that his high school coach thought the stopwatch was broken. He’d never clocked someone that slow.",
    "publisher": "Onyx publications LLc",
    "publication_date": "November 1, 2021",
    "last_price": 24.75,
    "discount": 12,
    "quantity": 1000,
    "pages_count": 98,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a4399",
    "average_rating": 2,
    "sub_category": "61f84cf43c4594f1d2f692ac"
  },
  {
    "i": 10,
    "title": "The Raven Spell",
    "language": "en",
    "author": "Luanne G. Smith",
    "cover": "https://m.media-amazon.com/images/I/51fjkBwvErL._SY346_.jpg",
    "overview": "In Victorian England a witch and a detective are on the hunt for a serial killer in an enthralling novel of magic and murder by the Amazon Charts and Washington Post bestselling author of The Vine Witch.",
    "description": "After a nearly fatal blow to the skull, traumatized private detective Ian Cameron is found dazed and confused on a muddy riverbank in Victorian London. Among his effects: a bloodstained business card bearing the name of a master wizard and a curious pocket watch that doesn’t seem to tell time. To retrieve his lost memories, Ian demands answers from Edwina and Mary Blackwood, sister witches with a murky past. But as their secret is slowly unveiled, a dangerous mystery emerges on the darkened streets of London.",
    "publisher": "47North",
    "publication_date": "February 1, 2022",
    "last_price": 5,
    "discount": 0,
    "quantity": 1000,
    "pages_count": 267,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a439a",
    "average_rating": 1,
    "sub_category": "61f84cf43c4594f1d2f692b1"
  },
  {
    "i": 11,
    "title": "Soccer IQ",
    "language": "en",
    "author": "Dan Blank",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51kbWpbbYzS._SX331_BO1,204,203,200_.jpg",
    "overview": "An Amazon #1 Best-Seller!Named the #1 Soccer Book by Football.com.Named a Top 5 Book of the Year by the NSCAA Soccer Journal.",
    "description": "n Amazon #1 Best-Seller!Named the #1 Soccer Book by Football.com.Named a Top 5 Book of the Year by the NSCAA Soccer Journal! Soccer iQ is the first book for soccer PLAYERS! In a world saturated with books about how to coach soccer, Dan Blank finally gives players a book on how to think it. Standing on two decades of collegiate coaching experience, Blank has catalogued soccer’s most common mistakes and provides simple, connect-the-dots solutions to help players solve their soccer problems. Soccer IQ is soccer’s first text book for players; an almanac of smarter soccer decisions intended to flatten out the learning curve. It covers everything from hunting rebounds to the value of the toe-ball; from playing in the rain to the world’s dumbest foul. Blank tells his story from the familiar and humorous voice of a coach who has endured years of stress at the hands of his players. Written in plain-spoken language, Soccer IQ is an easy read and a quick-fix to the most common yet critically important soccer problems. Includes a bonus chapter on the college recruiting process. “Finally someone wrote this book! If every soccer player read Soccer IQ, every coach would be a lot happier.” Mark Francis – Head Coach University of Kansas “Dan Blank has just written soccer’s first definitive text book.” Colin Carmichael – Head Coach Oklahoma State University “This book has immediately become required reading for my team. I’ll take 30 copies.”Steve Nugent – Head Coach UNC-Greensboro “Soccer IQ may the best practical soccer book I have ever read. There’s no fluff. Just nuts and bolts principles that we teach every day. It’ll solve a lot of your soccer problems.”Steve Holeman – Head Coach University of Georgia",
    "publisher": "CreateSpace Platform",
    "publication_date": "June 5, 2012",
    "last_price": 9.99,
    "discount": 0,
    "quantity": 1000,
    "pages_count": 133,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a439b",
    "average_rating": 5,
    "sub_category": "61f84cf43c4594f1d2f692b5"
  },
  {
    "i": 12,
    "title": "The Great Gatsby",
    "language": "en",
    "author": "F. Scott Fitzgerald",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41NssxNlPlS._SX331_BO1,204,203,200_.jpg",
    "overview": "So we beat on, boats against the current, borne back ceaselessly into the past.” ― F. Scott Fitzgerald, The Great Gatsby",
    "description": "The Great Gatsby is a 1925 novel by American writer F. Scott Fitzgerald. Set in the Jazz Age on Long Island, the novel depicts narrator Nick Carraway's interactions with mysterious millionaire Jay Gatsby and Gatsby's obsession to reunite with his former lover, Daisy Buchanan. A youthful romance Fitzgerald had with socialite Ginevra King, and the riotous parties he attended on Long Island's North Shore in 1922 inspired the novel. Following a move to the French Riviera, he completed a rough draft in 1924. He submitted the draft to editor Maxwell Perkins, who persuaded Fitzgerald to revise the work over the following winter. After his revisions, Fitzgerald was satisfied with the text, but remained ambivalent about the book's title and considered several alternatives. The final title he desired was Under the Red, White, and Blue. Painter Francis Cugat's final cover design impressed Fitzgerald who incorporated a visual element from the art into the novel.",
    "publisher": "Independently",
    "publication_date": "April 27, 2021",
    "last_price": 6,
    "discount": 0,
    "quantity": 1000,
    "pages_count": 110,
    "tags": ["#1 Best Seller"],
    "category": "61f84eb1dc1d9702913a439c",
    "average_rating": 4,
    "sub_category": "61f84cf43c4594f1d2f692ba"
  },
  {
    "i": 13,
    "title": "Impossible To Forget",
    "language": "en",
    "author": "Imogen Clark",
    "cover": "https://m.media-amazon.com/images/I/51828MxmXDL.jpg",
    "overview": "In this poignant novel from the bestselling author of Where the Story Starts, an extraordinary final wish brings five lives together forever.",
    "description": "Just turned eighteen, Romany is on the cusp of taking her first steps into adulthood when tragedy strikes, and she finds herself suddenly alone without her mother, Angie, the only parent she has ever known. In her final letter, Angie has charged her four closest friends with guiding Romany through her last year of school—but is there an ulterior motive to her unusual dying wish?",
    "publisher": "Lake Union Publishing",
    "publication_date": "February 1, 2022",
    "last_price": 5,
    "discount": 0,
    "quantity": 1000,
    "pages_count": 384,
    "category": "61f84eb1dc1d9702913a439d",
    "average_rating": 3,
    "sub_category": "61f84cf43c4594f1d2f692bf"
  },
  {
    "i": 14,
    "title": "Evidence-Based Practice in Nursing & Healthcare",
    "language": "en",
    "author": "Melnyk Phd",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51eNyp0w-qL._SX348_BO1,204,203,200_.jpg",
    "overview": "Evidence-Based Practice in Nursing & Healthcare: A Guide to Best Practice, 4th Edition Bernadette Mazurek Melnyk, PhD, RN, APRN-CNP, FAANP, FNAP, FAAN and Ellen Fineout-Overholt, PhD, RN, FNAP, FAAN",
    "description": "Develop the skills and knowledge you need to make evidence-based practice (EBP) an integral part of your clinical decision-making and everyday nursing practice with this proven, approachable text. Written in a straightforward, conversational style, Evidence-Based Practice in Nursing & Healthcare delivers real-world examples and meaningful strategies in every chapter to help you confidently meet today’s clinical challenges and ensure positive patient outcomes.",
    "publisher": "LWW",
    "publication_date": "November 24, 2018",
    "last_price": 102,
    "discount": 84,
    "quantity": 1000,
    "pages_count": 823,
    "category": "61f84eb1dc1d9702913a439e",
    "average_rating": 2,
    "sub_category": "61f84cf43c4594f1d2f692c4"
  }
]
