[
  {
    "ASIN": "0984782850",
    "title": "Cracking the Coding Interview",
    "author": "Gayle Laakmann",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41oYsXjLvZL._SX348_BO1,204,203,200_.jpg",
    "Publisher": "CareerCup",
    "publication_date": "July 1, 2015",
    "tags": ["#1 best seller"],
    "language": "en",
    "is_stock": true,
    "last_price": 40,
    "discount": 56,
    "quantity": 10,
    "pages_count": 687,
    "short_description": "Cracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book.",
    "description": "Cracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book. Learn how to uncover the hints and hidden details in a question, discover how to break down a problem into manageable chunks, develop techniques to unstick yourself when stuck, learn (or re-learn) core computer science concepts, and practice on 189 interview questions and solutions. These interview questions are real; they are not pulled out of computer science textbooks. They reflect what's truly being asked at the top companies, so that you can be as prepared as possible.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "1593279280",
    "title": "Python Crash Course",
    "author": "Eric Matthes",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51j89lmxnpL._SX377_BO1,204,203,200_.jpg",
    "Publisher": "No Starch Press",
    "publication_date": "May 3, 2019",
    "tags": ["#1 best seller"],
    "language": "en",
    "is_stock": true,
    "last_price": 40,
    "discount": 46,
    "quantity": 10,
    "pages_count": 544,
    "short_description": "Python Crash Course is the world's best-selling guide to the Python programming language. This fast-paced, thorough introduction to programming with Python will have you writing programs, solving problems, and making things that work in no time.",
    "description": "The second edition of the best-selling Python book in the world (over 1 million copies sold!). A fast-paced, no-nonsense guide to programming in Python. Updated and thoroughly revised to reflect the latest in Python code and practices. Python Crash Course is the world's best-selling guide to the Python programming language. This fast-paced, thorough introduction to programming with Python will have you writing programs, solving problems, and making things that work in no time. In the first half of the book, you'll learn basic programming concepts, such as variables, lists, classes, and loops, and practice writing clean code with exercises for each topic. You'll also learn how to make your programs interactive and test your code safely before adding it to a project. In the second half, you'll put your new knowledge into practice with three substantial projects: a Space Invaders-inspired arcade game, a set of data visualizations with Python's handy libraries, and a simple web app you can deploy online.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "0316487201",
    "title": "The Loop",
    "author": "Jacob Ward",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51DZhVzRr3L._SX330_BO1,204,203,200_.jpg",
    "Publisher": "Hachette Books",
    "publication_date": "January 25, 2022",
    "tags": ["#1 best seller"],
    "language": "en",
    "is_stock": true,
    "last_price": 29,
    "discount": 0,
    "quantity": 10,
    "pages_count": 320,
    "short_description": "This eye-opening narrative journey into the rapidly changing world of artificial intelligence reveals the dangerous ways AI is exploiting the unconscious habits of our minds—and the real threat it poses to humanity.",
    "description": "Artificial intelligence is going to change the world as we know it. But the real danger isn't some robot that's going to enslave us: It's our own brain. Our brains are constantly making decisions using shortcuts, biases, and hidden processes—and we're using those same techniques to create technology that makes choices for us. In The Loop, award-winning science journalist Jacob Ward reveals how we are poised to build all of our worst instincts into our AIs, creating a narrow loop where each generation has fewer, predetermined, and even dangerous choices.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "0198739834",
    "title": "Superintelligence",
    "author": "Nick Bostrom",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/519H6qwHjqL._SX328_BO1,204,203,200_.jpg",
    "Publisher": "Oxford University Press",
    "publication_date": "May 1, 2016",
    "language": "en",
    "is_stock": true,
    "last_price": 16,
    "discount": 10,
    "quantity": 10,
    "pages_count": 390,
    "short_description": "Superintelligence asks the questions: What happens when machines surpass humans in general intelligence? Will artificial agents save or destroy us? Nick Bostrom lays the foundation for understanding the future of humanity and intelligent life.",
    "description": "The human brain has some capabilities that the brains of other animals lack. It is to these distinctive capabilities that our species owes its dominant position. If machine brains surpassed human brains in general intelligence, then this new superintelligence could become extremely powerful - possibly beyond our control. As the fate of the gorillas now depends more on humans than on the species itself, so would the fate of humankind depend on the actions of the machine superintelligence.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "3982103819",
    "title": "Token Economy",
    "author": "Shermin Voshmgir",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41KdeY0zfOL._SX346_BO1,204,203,200_.jpg",
    "Publisher": "BlockchainHub Berlin",
    "publication_date": "June 5, 2020",
    "language": "en",
    "tags": ["#1 best seller"],
    "is_stock": true,
    "last_price": 28,
    "discount": 7,
    "quantity": 10,
    "pages_count": 360,
    "short_description": "This is the second edition of the book Token Economy originally published in June 2019. The basic structure of this second edition is the same as the first edition.",
    "description": "This is the second edition of the book Token Economy originally published in June 2019. The basic structure of this second edition is the same as the first edition, with slightly updated content of existing chapters and four additional chapters: 'User-Centric Identities,' 'Privacy Tokens,' 'Lending Tokens,' and How to Design a Token System and more focus on the Web3. //Part one outlines the fundamental building blocks of the Web3, including the role of cryptography and user-centric digital identities. Part two explains Web3 applications like smart contracts, DAOs & tokens. The last two parts of the book focus on tokens as the atomic unit of the Web3, explaining the properties and functions of money and outlining the emerging field of decentralized finance (DeFi) that might power a potential future digital barter economy.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "059323829X",
    "title": "AI 2041",
    "author": "Kai-Fu Lee",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/31cEOnpInQL._SX329_BO1,204,203,200_.jpg",
    "Publisher": "Currency",
    "publication_date": "September 14, 2021",
    "language": "en",
    "tags": ["editor's pick"],
    "is_stock": true,
    "last_price": 23.5,
    "discount": 0,
    "quantity": 10,
    "pages_count": 480,
    "short_description": "How will artificial intelligence change our world within twenty years?",
    "description": "AI will be the defining development of the twenty-first century. Within two decades, aspects of daily human life will be unrecognizable. AI will generate unprecedented wealth, revolutionize medicine and education through human-machine symbiosis, and create brand-new forms of communication and entertainment. In liberating us from routine work, however, AI will also challenge the organizing principles of our economic and social order. Meanwhile, AI will bring new risks in the form of autonomous weapons and smart technology that inherits human bias. AI is at a tipping point, and people need to wake up—both to AI’s radiant pathways and its existential perils for life as we know it.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "1603580557",
    "title": "Thinking in Systems",
    "author": "Donella H. Meadows",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41TJRhugQJL._SX324_BO1,204,203,200_.jpg",
    "Publisher": "Chelsea Green Publishing",
    "publication_date": "December 3, 2008",
    "language": "en",
    "is_stock": true,
    "last_price": 20,
    "discount": 43,
    "quantity": 10,
    "pages_count": 240,
    "short_description": "Thinking in Systems is required reading for anyone hoping to run a successful company, community, or country. Learning how to think in systems is now part of change-agent literacy. And this is the best book of its kind.",
    "description": "In the years following her role as the lead author of the international bestseller, Limits to Growth―the first book to show the consequences of unchecked growth on a finite planet―Donella Meadows remained a pioneer of environmental and social analysis until her untimely death in 2001. Thinking in Systems is a concise and crucial book offering insight for problem solving on scales ranging from the personal to the global. Edited by the Sustainability Institute’s Diana Wright, this essential primer brings systems thinking out of the realm of computers and equations and into the tangible world, showing readers how to develop the systems-thinking skills that thought leaders across the globe consider critical for 21st-century life.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "113318779X",
    "title": "Introduction to the Theory of Computation",
    "author": "Michael Sipser",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41QjHH1OfPL._SX332_BO1,204,203,200_.jpg",
    "Publisher": "Cengage Learning",
    "publication_date": "June 27, 2012",
    "language": "en",
    "is_stock": true,
    "last_price": 272,
    "discount": 84,
    "quantity": 10,
    "pages_count": 504,
    "short_description": "Gain a clear understanding of even the most complex, highly theoretical computational theory topics in the approachable presentation found only in the market-leading INTRODUCTION TO THE THEORY OF COMPUTATION, 3E.",
    "description": "Gain a clear understanding of even the most complex, highly theoretical computational theory topics in the approachable presentation found only in the market-leading INTRODUCTION TO THE THEORY OF COMPUTATION, 3E. The number one choice for today's computational theory course, this revision continues the book's well-know, approachable style with timely revisions, additional practice, and more memorable examples in key areas. A new first-of-its-kind theoretical treatment of deterministic context-free languages is ideal for a better understanding of parsing and LR(k) grammars. You gain a solid understanding of the fundamental mathematical properties of computer hardware, software, and applications with a blend of practical and philosophical coverage and mathematical treatments, including advanced theorems and proofs. INTRODUCTION TO THE THEORY OF COMPUTATION, 3E's comprehensive coverage makes this a valuable reference for your continued studies in theoretical computing.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "198508659X",
    "title": "Operating Systems: Three Easy Pieces",
    "author": "Remzi H Arpaci-Dusseau",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51rSSmdEUlL._SY344_BO1,204,203,200_.jpg",
    "Publisher": "CreateSpace Independent",
    "publication_date": "September 1, 2018",
    "language": "en",
    "is_stock": true,
    "last_price": 26,
    "discount": 10,
    "quantity": 10,
    "pages_count": 714,
    "short_description": "OSTEP, or the the comet book, represents the culmination of years of teaching intro to operating systems to both undergraduates and graduates at the University of Wisconsin-Madison Computer Sciences department for nearly 20 years.",
    "description": "OSTEP, or the the comet book, represents the culmination of years of teaching intro to operating systems to both undergraduates and graduates at the University of Wisconsin-Madison Computer Sciences department for nearly 20 years.The book is organized around three concepts fundamental to OS construction: virtualization (of CPU and memory), concurrency (locks and condition variables), and persistence (disks, RAIDS, and file systems).The material, if combined with serious project work and homeworks, will lead students to a deeper understanding and appreciation of modern OSes.The authors, Remzi and Andrea Arpaci-Dusseau, are both professors of Computer Sciences at the University of Wisconsin-Madison. They have been doing research in computer systems for over 20 years, working together since their first graduate operating systems class at U.C. Berkeley in 1993.Since that time, they have published over 100 papers on the performance and reliability of many aspects of modern computer systems, with a special focus on file and storage systems. Their work has been recognized with numerous best-paper awards, and some of their innovations can be found in the Linux and BSD operating systems today.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  },
  {
    "ASIN": "0262035618",
    "title": "Deep Learning",
    "author": "Ian Goodfellow",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/61qbj4KwauL._SX378_BO1,204,203,200_.jpg",
    "Publisher": "The MIT Press",
    "publication_date": "November 18, 2016",
    "language": "en",
    "is_stock": true,
    "last_price": 80,
    "discount": 50,
    "quantity": 10,
    "pages_count": 800,
    "short_description": "An introduction to a broad range of topics in deep learning, covering mathematical and conceptual background, deep learning techniques used in industry, and research perspectives.",
    "description": "Deep learning is a form of machine learning that enables computers to learn from experience and understand the world in terms of a hierarchy of concepts. Because the computer gathers knowledge from experience, there is no need for a human computer operator to formally specify all the knowledge that the computer needs. The hierarchy of concepts allows the computer to learn complicated concepts by building them out of simpler ones; a graph of these hierarchies would be many layers deep. This book introduces a broad range of topics in deep learning.",
    "category": "61f2340c6fadd645b13f9c92",
    "sub_category": "61f23056c6d3695912a2e36a"
  }
]
