[
  {
    "i": 1,
    "title": "Cracking the Coding Interview",
    "author": "Gayle McDowell",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41oYsXjLvZL._SX348_BO1,204,203,200_.jpg",
    "overview": "Cracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book.",
    "description": "I am not a recruiter. I am a software engineer. And as such, I know what it's like to be asked to whip up brilliant algorithms on the spot and then write flawless code on a whiteboard. I've been through this as a candidate and as an interviewer. Cracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book. Learn how to uncover the hints and hidden details in a question, discover how to break down a problem into manageable chunks, develop techniques to unstick yourself when stuck, learn (or re-learn) core computer science concepts, and practice on 189 interview questions and solutions. These interview questions are real; they are not pulled out of computer science textbooks. They reflect what's truly being asked at the top companies, so that you can be as prepared as possible. WHAT'S INSIDE?",
    "publisher": "CareerCup",
    "publication_date": "July 1, 2015",
    "language": "en",
    "pages_count": 687,
    "last_price": 39.95,
    "discount": 56,
    "quantity": 1000,
    "average_rating": 5,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a4398",
    "sub_category": "61f84cf43c4594f1d2f692a5"
  },
  {
    "i": 2,
    "title": "This Naked Mind",
    "author": "Annie Grace",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41hdZwgcnKL._SX360_BO1,204,203,200_.jpg",
    "overview": "This Naked Mind has ignited a movement across the country, helping thousands of people forever change their relationship with alcohol.",
    "description": "Many people question whether drinking has become too big a part of their lives, and worry that it may even be affecting their health. But, they resist change because they fear losing the pleasure and stress-relief associated with alcohol, and assume giving it up will involve deprivation and misery. This Naked Mind offers a new, positive solution. Here, Annie Grace clearly presents the psychological and neurological components of alcohol use based on the latest science, and reveals the cultural, social, and industry factors that support alcohol dependence in all of us.  Packed with surprising insight into the reasons we drink, this book will open your eyes to the startling role of alcohol in our culture, and how the stigma of alcoholism and recovery keeps people from getting the help they need. With Annie’s own extraordinary and candid personal story at its heart, this book is a must-read for anyone who drinks.",
    "publisher": "Avery",
    "publication_date": "January 2, 2018",
    "language": "en",
    "pages_count": 272,
    "last_price": 18,
    "discount": 28,
    "quantity": 1000,
    "average_rating": 4,
    "category": "61f84eb1dc1d9702913a4399",
    "sub_category": "61f84cf43c4594f1d2f692ab"
  },
  {
    "i": 3,
    "title": "House of Sky and Breath",
    "author": "Sarah J. Maas",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51sMvVvUL2L._SX324_BO1,204,203,200_.jpg",
    "overview": "Sarah J. Maas's sexy, groundbreaking CRESCENT CITY series continues with the second installment. Bryce Quinlan and Hunt Athalar are trying to get back to normal―they may have saved Crescent City, but with so much upheaval in their lives lately, they mostly want a chance to relax. Slow down. Figure out what the future holds.",
    "description": "Bryce Quinlan and Hunt Athalar are trying to get back to normal―they may have saved Crescent City, but with so much upheaval in their lives lately, they mostly want a chance to relax. Slow down. Figure out what the future holds. The Asteri have kept their word so far, leaving Bryce and Hunt alone. But with the rebels chipping away at the Asteri’s power, the threat the rulers pose is growing. As Bryce, Hunt, and their friends get pulled into the rebels’ plans, the choice becomes clear: stay silent while others are oppressed, or fight for what’s right. And they’ve never been very good at staying silent.",
    "publisher": "Bloomsbury Publishing",
    "publication_date": "February 15, 2022",
    "language": "en",
    "pages_count": 768,
    "last_price": 28,
    "discount": 36,
    "quantity": 1000,
    "average_rating": 3,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a439a",
    "sub_category": "61f84cf43c4594f1d2f692b0"
  },
  {
    "i": 4,
    "title": "Wish It Lasted Forever: Life with the Larry Bird Celtics",
    "author": "Dan Shaughnessy",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51vno+X-U+L._SX329_BO1,204,203,200_.jpg",
    "overview": "From award-winning Boston Globe columnist Dan Shaughnessy, an “entertaining” (The Wall Street Journal) and nostalgia-filled retelling of the 1980s Boston Celtics’ glory years, which featured the sublime play of NBA legend Larry Bird.",
    "description": "Today the NBA is a vast global franchise—a billion-dollar industry seen by millions of fans in the United States and abroad. But it wasn’t always this successful. Before primetime ESPN coverage, lucrative branding deals like Air Jordans, and $40 million annual player salaries, there was the NBA of the 1970s and 1980s—when basketball was still an up-and-coming sport featuring old school beat reporters and players who wore Converse All-Stars. Enter Dan Shaughnessy, then the beat reporter for The Boston Globe who covered the Boston Celtics every day from 1982 to1986. It was a time when reporters travelled with professional teams—flying the same commercial airlines, riding the same buses, and staying in the same hotels. Shaughnessy knew the athletes as real people, losing free throw bets to Larry Bird, being gifted cheap cigars by the iconic coach Red Auerbach, and having his one-year-old daughter Sarah passed from player to player on a flight from Logan to Detroit Metro.",
    "publisher": "Scribner",
    "publication_date": "November 16, 2021",
    "language": "en",
    "pages_count": 256,
    "last_price": 28,
    "discount": 16,
    "quantity": 1000,
    "average_rating": 4,
    "category": "61f84eb1dc1d9702913a439b",
    "sub_category": "61f84cf43c4594f1d2f692b4"
  },
  {
    "i": 5,
    "title": "A Court of Silver Flames",
    "author": "Sarah J. Maas",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51jbLXlw5kL._SX320_BO1,204,203,200_.jpg",
    "overview": "Sarah J. Maas's sexy, richly imagined series continues with the journey of Feyre's fiery sister, Nesta. Nesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it.",
    "description": "Nesta Archeron has always been prickly-proud, swift to anger, and slow to forgive. And ever since being forced into the Cauldron and becoming High Fae against her will, she's struggled to find a place for herself within the strange, deadly world she inhabits. Worse, she can't seem to move past the horrors of the war with Hybern and all she lost in it. The one person who ignites her temper more than any other is Cassian, the battle-scarred warrior whose position in Rhysand and Feyre's Night Court keeps him constantly in Nesta's orbit. But her temper isn't the only thing Cassian ignites. The fire between them is undeniable, and only burns hotter as they are forced into close quarters with each other.",
    "publisher": "Bloomsbury",
    "publication_date": "February 16, 2021",
    "language": "en",
    "pages_count": 768,
    "last_price": 28,
    "discount": 40,
    "quantity": 1000,
    "average_rating": 5,
    "tags": ["Editor's pick"],
    "category": "61f84eb1dc1d9702913a439c",
    "sub_category": "61f84cf43c4594f1d2f692b9"
  },
  {
    "i": 6,
    "title": "Dead Silence",
    "author": "S.A. Barnes",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/515v-JuM28L._SX322_BO1,204,203,200_.jpg",
    "overview": "Titanic meets The Shining in S.A. Barnes’ Dead Silence, a SF horror novel in which a woman and her crew board a decades-lost luxury cruiser and find the wreckage of a nightmare that hasn't yet ended.",
    "description": "Claire Kovalik is days away from being unemployed―made obsolete―when her beacon repair crew picks up a strange distress signal. With nothing to lose and no desire to return to Earth, Claire and her team decide to investigate. What they find is shocking: the Aurora, a famous luxury spaceliner that vanished on its maiden tour of the solar system more than twenty years ago. A salvage claim like this could set Claire and her crew up for life. But a quick search of the ship reveals something isn’t right. Whispers in the dark. Flickers of movement. Messages scrawled in blood. Claire must fight to hold on to her sanity and find out what really happened on the Aurora before she and her crew meet the same ghastly fate.",
    "publisher": "Tor Nightfire",
    "publication_date": "February 8, 2022",
    "language": "en",
    "pages_count": 352,
    "last_price": 27,
    "discount": 11,
    "quantity": 1000,
    "average_rating": 2,
    "tags": ["Editor's pick"],
    "category": "61f84eb1dc1d9702913a439d",
    "sub_category": "61f84cf43c4594f1d2f692be"
  },
  {
    "i": 7,
    "title": "Celebrate Your Body",
    "author": "Sonya Taylor",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51yNeVPnrwL._SX331_BO1,204,203,200_.jpg",
    "overview": "A body-positive guide to help girls ages 8 to 12 navigate the changes of puberty",
    "description": "Puberty can be a difficult time for a young girl―and it’s natural not to know who (or what) to ask. Celebrate Your Body is a reassuring entry into puberty books for girls that encourages girls to face puberty with excitement and empowerment. From period care to mysterious hair in new places, this age-appropriate sex education book has the answers you’re looking for―in a way you can relate to. Covering everything from bras to braces, this body-positive top choice in books about puberty for girls offers friendly guidance and support when you need it most. In addition to tips on managing intense feelings, making friends, and more, you’ll get advice on what to eat and how to exercise so your body is healthy, happy, and ready for the changes ahead.",
    "publisher": "Rockridge Press",
    "publication_date": "May 29, 2018",
    "language": "en",
    "pages_count": 174,
    "last_price": 13,
    "discount": 37,
    "quantity": 1000,
    "average_rating": 5,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a439e",
    "sub_category": "61f84cf43c4594f1d2f692c3"
  },
  {
    "i": 8,
    "title": "Continuous Discovery Habits",
    "author": "Teresa Torres",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41O-IVvXtmS._SX331_BO1,204,203,200_.jpg",
    "overview": "If you haven't had the good fortune to be coached by a strong leader or product coach, this book can help fill that gap and set you on the path to success.",
    "description": "How do you know that you are making a product or service that your customers want? How do you ensure that you are improving it over time? How do you guarantee that your team is creating value for your customers in a way that creates value for your business? In this book, you'll learn a structured and sustainable approach to continuous discovery that will help you answer each of these questions, giving you the confidence to act while also preparing you to be wrong. You'll learn to balance action with doubt so that you can get started without being blindsided by what you don't get right. If you want to discover products that customers love-that also deliver business results-this book is for you.",
    "publisher": "Product Talk LLC",
    "publication_date": "April 14, 2021",
    "language": "en",
    "pages_count": 244,
    "last_price": 20,
    "discount": 8,
    "quantity": 1000,
    "average_rating": 3,
    "category": "61f84eb1dc1d9702913a4398",
    "sub_category": "61f84cf43c4594f1d2f692a6"
  },
  {
    "i": 9,
    "title": "Knee Ability Zero",
    "author": "Ben Patrick",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41Z51ijeLmL._SX331_BO1,204,203,200_.jpg",
    "overview": "The Zero actually refers to zero weights, zero gym memberships and zero athletic ability needed to make dramatic gains in your overall health and fitness. All you need is THIS BOOK.",
    "description": "Author Ben Patrick - aka #kneesovertoesguy - started out as something of an athletic zero. Sure, he was a good basketball player fundamentally, but his 19-inch vertical was laughable, and his time in the 40-yard dash was so tortoise-like that his high school coach thought the stopwatch was broken. He’d never clocked someone that slow. As if that genetic conspiracy wasn’t enough, Ben endured knee pain starting at age 8. After three knee surgeries and countless trips to the personal hell where constant pain resides, Ben retired from the game he loved at the ripe old age of 18. With zero hesitancy, he devoted his life to developing exercises that would not only help others avoid what he’d gone through, but reach a level of athleticism that maybe they’d only dreamed of achieving.",
    "publisher": "Onyx publications LLc",
    "publication_date": "November 1, 2021",
    "language": "en",
    "pages_count": 98,
    "last_price": 24.75,
    "discount": 15,
    "quantity": 1000,
    "average_rating": 2,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a4399",
    "sub_category": "61f84cf43c4594f1d2f692ac"
  },
  {
    "i": 10,
    "title": "Go Tell the Bees That I Am Gone",
    "author": "Diana Gabaldon",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51uf17CjFMS._SX327_BO1,204,203,200_.jpg",
    "overview": "Jamie Fraser and Claire Randall were torn apart by the Jacobite Rising in 1746, and it took them twenty years to find each other again. Now the American Revolution threatens to do the same.",
    "description": "Jamie Fraser and Claire Randall were torn apart by the Jacobite Rising in 1746, and it took them twenty years to find each other again. Now the American Revolution threatens to do the same. It is 1779 and Claire and Jamie are at last reunited with their daughter, Brianna, her husband, Roger, and their children on Fraser’s Ridge. Having the family together is a dream the Frasers had thought impossible. Yet even in the North Carolina backcountry, the effects of war are being felt. Tensions in the Colonies are great and local feelings run hot enough to boil Hell’s teakettle. Jamie knows loyalties among his tenants are split and it won’t be long until the war is on his doorstep.",
    "publisher": "Delacorte Press",
    "publication_date": "November 23, 2021",
    "language": "en",
    "pages_count": 928,
    "last_price": 36,
    "discount": 41,
    "quantity": 1000,
    "average_rating": 2,
    "tags": ["MEBOOK charts"],
    "category": "61f84eb1dc1d9702913a439a",
    "sub_category": "61f84cf43c4594f1d2f692b1"
  },
  {
    "i": 11,
    "title": "Soccer IQ",
    "author": "Dan Blank",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51kbWpbbYzS._SX331_BO1,204,203,200_.jpg",
    "overview": "An Amazon #1 Best-Seller!Named the #1 Soccer Book by Football.com.Named a Top 5 Book of the Year by the NSCAA Soccer Journal! Soccer iQ is the first book for soccer PLAYERS! In a world saturated with books about how to coach soccer.",
    "description": "Dan Blank finally gives players a book on how to think it. Standing on two decades of collegiate coaching experience, Blank has catalogued soccer’s most common mistakes and provides simple, connect-the-dots solutions to help players solve their soccer problems. Soccer IQ is soccer’s first text book for players; an almanac of smarter soccer decisions intended to flatten out the learning curve. It covers everything from hunting rebounds to the value of the toe-ball; from playing in the rain to the world’s dumbest foul. Blank tells his story from the familiar and humorous voice of a coach who has endured years of stress at the hands of his players. Written in plain-spoken language, Soccer IQ is an easy read and a quick-fix to the most common yet critically important soccer problems. Includes a bonus chapter on the college recruiting process.",
    "publisher": "CreateSpace Platform",
    "publication_date": "June 5, 2019",
    "language": "en",
    "pages_count": 133,
    "last_price": 10,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 1,
    "category": "61f84eb1dc1d9702913a439b",
    "sub_category": "61f84cf43c4594f1d2f692b5"
  },
  {
    "i": 12,
    "title": "The Last Bookshop in London",
    "author": "Madeline Martin",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51okdr+x7HS._SX332_BO1,204,203,200_.jpg",
    "overview": "An irresistible tale which showcases the transformative power of literacy, reminding us of the hope and sanctuary our neighborhood bookstores offer during the perilous trials of war and unrest.",
    "description": "August 1939: London prepares for war as Hitler’s forces sweep across Europe. Grace Bennett has always dreamed of moving to the city, but the bunkers and drawn curtains that she finds on her arrival are not what she expected. And she certainly never imagined she’d wind up working at Primrose Hill, a dusty old bookshop nestled in the heart of London.    ",
    "publisher": "Hanover Square Press",
    "publication_date": "April 6, 2021",
    "language": "en",
    "pages_count": 320,
    "last_price": 17,
    "discount": 15,
    "quantity": 1000,
    "average_rating": 1,
    "category": "61f84eb1dc1d9702913a439c",
    "sub_category": "61f84cf43c4594f1d2f692ba"
  },
  {
    "i": 13,
    "title": "The Three-Body Problem",
    "author": "Cixin Liu",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51hshl7LRTL._SX329_BO1,204,203,200_.jpg",
    "overview": "The Three-Body Problem is the first chance for English-speaking readers to experience the Hugo Award-winning phenomenon from China's most beloved science fiction author, Liu Cixin.",
    "description": "Set against the backdrop of China's Cultural Revolution, a secret military project sends signals into space to establish contact with aliens. An alien civilization on the brink of destruction captures the signal and plans to invade Earth. Meanwhile, on Earth, different camps start forming, planning to either welcome the superior beings and help them take over a world seen as corrupt, or to fight against the invasion. The result is a science fiction masterpiece of enormous scope and vision.",
    "publisher": "Tor Books",
    "publication_date": "January 12, 2017",
    "language": "en",
    "pages_count": 416,
    "last_price": 18,
    "discount": 41,
    "quantity": 1000,
    "average_rating": 2,
    "category": "61f84eb1dc1d9702913a439d",
    "sub_category": "61f84cf43c4594f1d2f692bf"
  },
  {
    "i": 14,
    "title": "Deep Medicine",
    "author": "Eric Topol MD",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41Vc8hqJUIL._SX321_BO1,204,203,200_.jpg",
    "overview": "One of America's top doctors reveals how AI will empower physicians and revolutionize patient care Medicine has become inhuman, to disastrous effect. ",
    "description": "The doctor-patient relationship--the heart of medicine--is broken: doctors are too distracted and overwhelmed to truly connect with their patients, and medical errors and misdiagnoses abound. In Deep Medicine, leading physician Eric Topol reveals how artificial intelligence can help. AI has the potential to transform everything doctors do, from notetaking and medical scans to diagnosis and treatment, greatly cutting down the cost of medicine and reducing human mortality. By freeing physicians from the tasks that interfere with human connection, AI will create space for the real healing that takes place between a doctor who can listen and a patient who needs to be heard.",
    "publisher": "Basic Books",
    "publication_date": "March 12, 2019",
    "language": "en",
    "pages_count": 400,
    "last_price": 32,
    "discount": 36,
    "quantity": 1000,
    "average_rating": 2,
    "category": "61f84eb1dc1d9702913a439e",
    "sub_category": "61f84cf43c4594f1d2f692c4"
  },
  {
    "i": 15,
    "title": "West with Giraffes",
    "author": "Lynda Rutledge",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51i-qq73N4L._SX331_BO1,204,203,200_.jpg",
    "overview": "Woodrow Wilson Nickel, age 105, feels his life ebbing away. But when he learns giraffes are going extinct, he finds himself recalling the unforgettable experience he cannot take to his grave.",
    "description": "t’s 1938. The Great Depression lingers. Hitler is threatening Europe, and world-weary Americans long for wonder. They find it in two giraffes who miraculously survive a hurricane while crossing the Atlantic. What follows is a twelve-day road trip in a custom truck to deliver Southern California’s first giraffes to the San Diego Zoo. Behind the wheel is the young Dust Bowl rowdy Woodrow. Inspired by true events, the tale weaves real-life figures with fictional ones, including the world’s first female zoo director, a crusty old man with a past, a young female photographer with a secret, and assorted reprobates as spotty as the giraffes.",
    "publisher": "Lake Union Publishing",
    "publication_date": "February 1, 2021",
    "language": "en",
    "pages_count": 371,
    "last_price": 15,
    "discount": 26,
    "quantity": 1000,
    "average_rating": 4,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a4398",
    "sub_category": "61f84cf43c4594f1d2f692a7"
  },
  {
    "i": 16,
    "title": "Hello New Me",
    "author": "Happy Books Hub",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51ipAXY6A2L._SX404_BO1,204,203,200_.jpg",
    "overview": "Hello New Me food and exercise journal for women is your perfect daily companion on the journey to become the best version of yourself!",
    "description": "You will love it. It is cute, simple, clear, easy to use, and very organized. Now you can keep track of what you eat, how active you are, your habits, and evaluate what you can change about your diet and daily routines. Hello New Me will be your convenient diary and motivating planner during your next 90 days (the standard time span for a weight training program).",
    "publisher": "CreateSpace Platform",
    "publication_date": "February 24, 2016",
    "language": "en",
    "pages_count": 110,
    "last_price": 8,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 3,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a4399",
    "sub_category": "61f84cf43c4594f1d2f692ad"
  },
  {
    "i": 17,
    "title": "The Mighty Nein Origins",
    "author": "Jody Houser",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51L-RNhjdgL._SX329_BO1,204,203,200_.jpg",
    "overview": "Vox Machina Origins writer Jody Houser joins fan-favorite artist Selina Espiritu, and Matthew Mercer and Liam O'Brian to reveal Caleb's troubled past in this all-new hardcover graphic novel! Fans of Critical Role won't want to miss this newest edition to their Mighty Nein library!",
    "description": "When Bren Aldric Ermendrud was chosen to attend the Soltryce Academy, everyone knew he would have an important future in service to the Empire. But nobody--least of all Bren himself--could foresee the cruelty he endured, and the ways in which it would break and remake him. Witness the events that transform Bren into the Mighty Nein's Caleb Widogast, and how they'll inform the path he'll take in the future.",
    "publisher": "Dark Horse Books",
    "publication_date": "February 8, 2022",
    "language": "en",
    "pages_count": 56,
    "last_price": 18,
    "discount": 11,
    "quantity": 1000,
    "average_rating": 1,
    "tags": ["#1 New Release"],
    "category": "61f84eb1dc1d9702913a439a",
    "sub_category": "61f84cf43c4594f1d2f692b2"
  },
  {
    "i": 18,
    "title": "Full Out",
    "author": "Monica Aldama",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51RAzvHzRqL._SX328_BO1,204,203,200_.jpg",
    "overview": "From the breakout star of Netflix’s Cheer, a motivational and inspiring guide to becoming a champion in all areas of life.",
    "description": "In Full Out, “the Bill Belichick of cheerleading” (The Cut) Coach Monica Aldama shares how she built one of the most successful and beloved cheerleading programs in the country. Her uncompromising brand of discipline and consistency goes far beyond the mat—showing how the principles of building a winning team apply to personal goals, the corporate world, parenting, and all aspects of life.",
    "publisher": "Gallery Books",
    "publication_date": "January 4, 2022",
    "language": "en",
    "pages_count": 256,
    "last_price": 28,
    "discount": 30,
    "quantity": 1000,
    "average_rating": 3,
    "category": "61f84eb1dc1d9702913a439b",
    "sub_category": "61f84cf43c4594f1d2f692b6"
  },
  {
    "i": 19,
    "title": "Blindsided",
    "author": "Amy Daws",
    "cover": "https://m.media-amazon.com/images/I/51pXS3fqWdL.jpg",
    "overview": "What happens when an almost thirty-year-old virgin agrees to let her Scottish footballer best friend give her some lessons in seduction?",
    "description": "Midfielder Maclay Logan is a loud-mouthed, tattooed ginger content with focusing on football. But when an adorable, freckled seamstress comes barreling into his life, he finds Netflix-And-Bickering with her to be his new favorite pastime. Freya Cook is used to being the invisible woman with a needle and thread, offering cheeky punchlines as she helps dress London's finest. She's plus-sized in body and spirit, and other than her friendship with Mac, talking to the opposite sex is one skill she never mastered.",
    "publisher": "Amy Daws, LLC",
    "publication_date": "November 21, 2018",
    "language": "en",
    "pages_count": 322,
    "last_price": 15,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 1,
    "tags": ["MEBOOK charts"],
    "category": "61f84eb1dc1d9702913a439c",
    "sub_category": "61f84cf43c4594f1d2f692bb"
  },
  {
    "i": 20,
    "title": "A Train to Moscow",
    "author": "Elena Gorokhova",
    "cover": "https://m.media-amazon.com/images/I/51-drnhcLnL.jpg",
    "overview": "In post–World War II Russia, a girl must reconcile a tragic past with her hope for the future in this powerful and poignant novel about family secrets, passion and loss, perseverance and ambition.",
    "description": "In a small, provincial town behind the Iron Curtain, Sasha lives in a house full of secrets, one of which is her own dream of becoming an actress. When she leaves for Moscow to audition for drama school, she defies her mother and grandparents and abandons her first love, Andrei.",
    "publisher": " Lake Union Publishing",
    "publication_date": "March 1, 2020",
    "language": "en",
    "pages_count": 315,
    "last_price": 5,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 4,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a439d",
    "sub_category": "61f84cf43c4594f1d2f692c0"
  },
  {
    "i": 21,
    "title": "On Becoming Babywise",
    "author": "Robert Bucknam M.D",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41ijt2in-lL._SX298_BO1,204,203,200_.jpg",
    "overview": "For 30 years, On Becoming Babywise has been the de facto newborn parenting manual for naturally synchronizing your baby's feeding time, waketime and nighttime sleep cycles, so the whole family can sleep through the night. ",
    "description": "In his 4th decade as a licensed Pediatrician, Dr. Robert Bucknam, M.D. along with co-author Gary Ezzo, demonstrate how order and stability are mutual allies of every newborn's metabolism and how parents can take advantage of these biological propensities. In particular, they note how an infant's body responds to the influences of parental routine or the lack thereof. Early chapters start with explorations of everyday aspects of infant management such as the three basic elements of daytime activities for newborns: feeding time, waketime, and naptime. Practical discussions then focus on broad and niche topics including feeding philosophies, baby sleep problems, baby scheduling challenges, nap routines, sleep training multiples, baby sleeping props, Colic and Reflux and many other dimensions which impact breast feeding schedules, bottle feeding tips, and baby sleeping training. Five resource Appendixes provide additional reference material: 1) Taking care of baby and mom 2) A timeline of what to expect and when 3)Baby Sleep Training Problems and Solutions 4)Monitoring Your Baby's Growth 5) Healthy Baby Growth Charts On Becoming Babywise is more than an infant-management concept. It is a mindset for successful parenthood. It can help any parent develop a plan that meets both the needs of a new baby and of the entire family. These principles have worked for millions of parents and, when applied with common sense to your unique situation, can work wonderfully for you too! Recommended by doctors across the country.",
    "publisher": "Hawksflight & Associates",
    "publication_date": "November 15, 2020",
    "language": "en",
    "pages_count": 276,
    "last_price": 13,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 3,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a439e",
    "sub_category": "61f84cf43c4594f1d2f692c5"
  },
  {
    "i": 22,
    "title": "Clean Code",
    "author": "Robert C. Martin",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41xShlnTZTL._SX376_BO1,204,203,200_.jpg",
    "overview": "Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way.",
    "description": "What kind of work will you be doing? You’ll be reading code―lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code―of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and “smells” gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code.",
    "publisher": " Pearson",
    "publication_date": "August 1, 2010",
    "language": "en",
    "pages_count": 464,
    "last_price": 50,
    "discount": 50,
    "quantity": 1000,
    "average_rating": 5,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a4398",
    "sub_category": "61f84cf43c4594f1d2f692a8"
  },
  {
    "i": 23,
    "title": "Population One",
    "author": "Tyler McNamer",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41TvpbfzT2L._SX319_BO1,204,203,200_.jpg",
    "overview": "Part memoir, part inspirational guide, Population One: Autism, Adversity, and the Will to Succeed is a groundbreaking book that offers readers the ability to see life through the eyes of a young man with autism. Written by Tyler McNamer at the age of 17, Tyler not only details his challenges, but he also offers hope and encouragement to others who face seemingly insurmountable obstacles. Whether you re an educator, a family member of someone with autism.",
    "description": "simply looking for inspiration, you ll appreciate the opportunity to step inside this remarkable young man s mind. As Tyler explains, I ve been called a retard, dumb, and disabled. I ve been bullied, picked on, and made fun of. They put me in special classes and told me that I should not expect to reach my goals. Yet rather than view his diagnosis negatively, Tyler considers his unique viewpoint a gift. It is with this perspective that he wrote Population One: Autism, Adversity, and the Will to Succeed. In this memorable book, Tyler details his experiences with bullying, isolation, and others low expectations of him. But rather than allowing himself to be limited by his autism diagnosis, this courageous and insightful young man rose above his challenges to encourage others to follow their dreams and become leaders in their own lives. The result is this book, an autobiographical recounting of Tyler s journey with diverse essays containing his thoughts about leadership, courage, and adversity. Wise beyond his years, Tyler concludes that despite our differences, we can become a population of one, uniting to serve others. If you want to be uplifted or understand someone with autism better you must read Population of One. This inspirational and engaging book will transform the way you view the world.",
    "publisher": "Avia",
    "publication_date": "August 5, 2013",
    "language": "en",
    "pages_count": 205,
    "last_price": 20,
    "discount": 4,
    "quantity": 1000,
    "average_rating": 4,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a4399",
    "sub_category": "61f84cf43c4594f1d2f692ae"
  },
  {
    "i": 24,
    "title": "Forge Your Dragon World",
    "author": "Tui T. Sutherland",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51kuhpoCcEL._SX336_BO1,204,203,200_.jpg",
    "overview": "Write your legend, draw your destiny, and take flight! The legend starts with you!Do you love to draw or write? Do you have your very own dragon stories to tell?",
    "description": "In this official Wings of Fire journal, you'll design awesome characters, imagine new adventures, and forge YOUR fantasy world!With examples from Wings of Fire graphic artist Mike Holmes, Tui T. Sutherland guides you through the #1 New York Times bestselling Wings of Fire series in a more interactive and exciting way than ever before.Spread your wings with your very own graphic story creation!",
    "publisher": "Delacorte Press",
    "publication_date": "May 21, 2019",
    "language": "en",
    "pages_count": 144,
    "last_price": 13,
    "discount": 28,
    "quantity": 1000,
    "average_rating": 3,
    "category": "61f84eb1dc1d9702913a439a",
    "sub_category": "61f84cf43c4594f1d2f692b3"
  },
  {
    "i": 25,
    "title": "HWPO: Hard Work Pays Off",
    "author": "Mat Fraser",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41bAyDs8bYL._SX331_BO1,204,203,200_.jpg",
    "overview": "No matter your level of fitness, no matter if you’ve never attempted CrossFit before, this book is your total training manual.",
    "description": "Mat Fraser is undisputedly the fittest man in CrossFit history for winning the CrossFit Games an unprecedented five times. A student of engineering, Fraser optimized his body like a machine, and his absolute dedication to the training program he designed for himself is now legendary. For years, every single decision he made was weighed against the question: 'Will this help me win?' If the answer was no, he didn't do it. If it would give him even the slightest edge or advantage, he would—no matter the cost. Fraser became a master of identifying his weaknesses and then seeking out training methods to improve them, and he's idolized in the fitness community for his relentless pursuit of peak performance. It's not hard to see why he achieved so much success—but how is a different question.",
    "publisher": "Rodale Books",
    "publication_date": "January 11, 2022",
    "language": "en",
    "pages_count": 320,
    "last_price": 20,
    "discount": 17,
    "quantity": 1000,
    "average_rating": 2,
    "tags": ["#1 New Release"],
    "category": "61f84eb1dc1d9702913a439b",
    "sub_category": "61f84cf43c4594f1d2f692b7"
  },
  {
    "i": 26,
    "title": "Texas Homecoming",
    "author": "Carolyn Brown",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51IymJrkgVL._SX338_BO1,204,203,200_.jpg",
    "overview": "The bestselling Queen of Cowboy Romance delivers a heartwarming novel where a doctor and veterinarian get a second chance at true love when a storm traps them together.",
    "description": "The bestselling Queen of Cowboy Romance delivers a heartwarming novel where a doctor and veterinarian get a second chance at true love when a storm traps them together.",
    "publisher": "Forever",
    "publication_date": "January 25, 2021",
    "language": "en",
    "pages_count": 336,
    "last_price": 9,
    "discount": 25,
    "quantity": 1000,
    "average_rating": 1,
    "category": "61f84eb1dc1d9702913a439c",
    "sub_category": "61f84cf43c4594f1d2f692bc"
  },
  {
    "i": 27,
    "title": "Harry Potter and the Cursed Child",
    "author": "J.K. Rowling",
    "cover": "https://m.media-amazon.com/images/I/51G+WN7UghL.jpg",
    "overview": "The official playscript of the original West End production of Harry Potter and the Cursed Child. It was always difficult being Harry Potter and it isn't much easier now that he is an overworked employee of the Ministry of Magic, a husband, and father of three school-age children.",
    "description": "While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places. The playscript for Harry Potter and the Cursed Child was originally released as a 'special rehearsal edition' alongside the opening of Jack Thorne's play in London's West End in summer 2016. Based on an original story by J.K. Rowling, John Tiffany and Jack Thorne, the play opened to rapturous reviews from theatregoers and critics alike, while the official playscript became an immediate global bestseller. This definitive and final playscript updates the 'special rehearsal edition' with the conclusive and final dialogue from the play, which has subtly changed since its rehearsals, as well as a conversation piece between director John Tiffany and writer Jack Thorne, who share stories and insights about reading playscripts. This edition also includes useful background information including the Potter family tree and a timeline of events from the Wizarding World prior to the beginning of Harry Potter and the Cursed Child.",
    "publisher": "Pottermore Publishing",
    "publication_date": "July 25, 2017",
    "language": "en",
    "pages_count": 336,
    "last_price": 9,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 4,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a439d",
    "sub_category": "61f84cf43c4594f1d2f692c1"
  },
  {
    "i": 28,
    "title": "Davis's Drug Guide for Nurses",
    "author": "April Hazard",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41oW4pW7oaL._SX317_BO1,204,203,200_.jpg",
    "overview": "#1 DRUG BOOK for Nursing Students! “This is the perfect drug book for nursing school! All the information on the meds is in-depth and all that you need to know.”—Abby W.",
    "description": "Davis’s Drug Guide for Nurses®, Seventeenth Edition delivers all the information you need to administer medications safely across the lifespan—well-organized monographs for hundreds of generic and thousands of trade-name drugs. Redeem the access code to unlock your one-year, free subscription to DrugGuide.com, Davis’s Drug Guide Online, powered by Unbound Medicine. You’ll have access to more than 1,700 monographs from your desktop, laptop, or any mobile device with a web browser.",
    "publisher": "F.A. Davis Company",
    "publication_date": "May 21, 2020",
    "language": "en",
    "pages_count": 1499,
    "last_price": 53,
    "discount": 10,
    "quantity": 1000,
    "average_rating": 3,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a439e",
    "sub_category": "61f84cf43c4594f1d2f692c6"
  },
  {
    "i": 29,
    "title": "Seven Figure Social Selling",
    "author": "Brandon Bornancin",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51qR4bLrlsL._SX322_BO1,204,203,200_.jpg",
    "overview": "Once you’ve mastered social selling, you’ll never be without work or money again! If you’ve ever been frustrated by the lack of appointments, lack of sales, or lack of income to provide for your family or build the life you want and always dreamed of… then this is the book you need!",
    "description": "One of 15 books inside the “Seven Figure Sales System,” Seven Figure Social Selling contains over 400 pages of easy-to-implement social selling scripts, strategies, systems and secrets to winning your dream customers on LinkedIn. This step-by-step guide will help anyone get more leads, appointments and sales… no matter what you sell or who you sell to (EVEN IF you don’t have a big social network AND ZERO social selling experience!).In fact, Seven Figure Social Selling is the exact playbook Brandon Bornancin and his team at Seamless.AI use to flood their calendars with 75-100 appointments every single day! They generate millions in sales, and consistently receive over 1M views a month on Linkedin.",
    "publisher": "Brandon Bornancin",
    "publication_date": "April 17, 2020",
    "language": "en",
    "pages_count": 502,
    "last_price": 20,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 1,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a4398",
    "sub_category": "61f84cf43c4594f1d2f692a9"
  },
  {
    "i": 30,
    "title": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51mN3bY0JjL._SX332_BO1,204,203,200_.jpg",
    "overview": "In this generation-defining self-help guide, a superstar blogger cuts through the crap to show us how to stop trying to be positive all the time so that we can truly become better, happier people.",
    "description": "For decades, we’ve been told that positive thinking is the key to a happy, rich life. F**k positivity, Mark Manson says. Let’s be honest, shit is f**ked and we have to live with it. In his wildly popular Internet blog, Manson doesn’t sugarcoat or equivocate. He tells it like it is—a dose of raw, refreshing, honest truth that is sorely lacking today. The Subtle Art of Not Giving a F**k is his antidote to the coddling, let’s-all-feel-good mindset that has infected modern society and spoiled a generation, rewarding them with gold medals just for showing up.",
    "publisher": " Harper",
    "publication_date": "September 13, 2016",
    "language": "en",
    "pages_count": 224,
    "last_price": 27,
    "discount": 50,
    "quantity": 1000,
    "average_rating": 2,
    "tags": ["MEBOOK charts"],
    "category": "61f84eb1dc1d9702913a4399",
    "sub_category": "61f84cf43c4594f1d2f692af"
  },
  {
    "i": 31,
    "title": "Nala's World",
    "author": "Dean Nicholson",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51tw2DZnmRS._SX331_BO1,204,203,200_.jpg",
    "overview": "Discover the national bestseller and heartwarming true story of the life-changing friendship between a man and his rescue cat, Nala, as they adventure together on a bike journey around the world—now with a new Q&A from the author! ",
    "description": "When Dean Nicholson left his life in Scotland to cycle around the world, he wanted to learn as much as he could about our troubled planet. Then, on a remote road in the Bosnian mountains, Dean came across an abandoned kitten. He couldn’t leave the bedraggled creature, so he put her on his bike, smuggled her over the border to Montenegro, and nursed her back to health with the help of local vets. Dean hadn’t bargained for this unlikely companion for his travels—or the lessons he would learn from her along the way.",
    "publisher": "Grand Central Publishing",
    "publication_date": "September 28, 2021",
    "language": "en",
    "pages_count": 272,
    "last_price": 17,
    "discount": 27,
    "quantity": 1000,
    "average_rating": 3,
    "category": "61f84eb1dc1d9702913a439b",
    "sub_category": "61f84cf43c4594f1d2f692b8"
  },
  {
    "i": 32,
    "title": "The Return",
    "author": "Nicholas Sparks",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51lHNrX5W6S._SX326_BO1,204,203,200_.jpg",
    "overview": "In the romantic tradition of Dear John, an injured Navy doctor meets two extremely important women whose secrets will change the course of his life in this #1 New York Times bestseller.",
    "description": "Trevor Benson never intended to move back to New Bern, North Carolina. But when a mortar blast outside the hospital where he worked sent him home from Afghanistan with devastating injuries, the dilapidated cabin he'd inherited from his grandfather seemed as good a place to regroup as any. Tending to his grandfather's beloved beehives, Trevor isn't prepared to fall in love with a local . . . yet, from their very first encounter, Trevor feels a connection with deputy sheriff Natalie Masterson that he can't ignore. But even as she seems to reciprocate his feelings, she remains frustratingly distant, making Trevor wonder what she's hiding.",
    "publisher": "Grand Central Publishing",
    "publication_date": "August 10, 2021",
    "language": "en",
    "pages_count": 400,
    "last_price": 17,
    "discount": 28,
    "quantity": 1000,
    "average_rating": 4,
    "category": "61f84eb1dc1d9702913a439c",
    "sub_category": "61f84cf43c4594f1d2f692bd"
  },
  {
    "i": 33,
    "title": "A Carnival of Snackery",
    "author": "David Sedaris",
    "cover": "https://m.media-amazon.com/images/I/41VmBkp9cuL.jpg",
    "overview": "There’s no right way to keep a diary, but if there’s an entertaining way, David Sedaris seems to have mas­tered it.",
    "description": "If it’s navel-gazing you’re after, you’ve come to the wrong place; ditto treacly self-examination. Rather, his observations turn outward: a fight between two men on a bus, a fight between two men on the street, pedestrians being whacked over the head or gathering to watch as a man considers leap­ing to his death. There’s a dirty joke shared at a book signing, then a dirtier one told at a dinner party—lots of jokes here. Plenty of laughs.",
    "publisher": "Little, Brown and Company",
    "publication_date": "October 5, 2021",
    "language": "en",
    "pages_count": 577,
    "last_price": 16,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 5,
    "tags": ["#1 Bestseller"],
    "category": "61f84eb1dc1d9702913a439d",
    "sub_category": "61f84cf43c4594f1d2f692c2"
  },
  {
    "i": 34,
    "title": "The Poison Path Herbal",
    "author": "Coby Michael",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/51Xd5o+TE5L._SY344_BO1,204,203,200_.jpg",
    "overview": "A guide to safely working with the poisonous plants of the witches’ pharmacopoeia for magic, healing, and visions ",
    "description": "Part grimoire and part herbal formulary, this guide to the Poison Path of occult herbalism shares history, lore, and information regarding the use of poisonous, consciousness-altering, and magical plants. Author Coby Michael explains how, despite their poisonous nature, baneful herbs can become powerful plant allies, offering potent medicine, magical wisdom, and access to the spirit realm. Detailing the spiritual, alchemical, astrological, and symbolic associations of each plant, the author explores their magical uses in spells and rituals. He focuses primarily on the nightshade family, or Solanaceae, such as mandrake, henbane, and thorn apple, but also explores plants from other families such as wolfsbane, hemlock, and hellebore. He also examines plants in the witch’s pharmacopoeia that are safer to work with and just as chemically active, such as wormwood, mugwort, and yarrow.",
    "publisher": "Park Street Press",
    "publication_date": "October 26, 2021",
    "language": "en",
    "pages_count": 256,
    "last_price": 20,
    "discount": 5,
    "quantity": 1000,
    "average_rating": 4,
    "category": "61f84eb1dc1d9702913a439e",
    "sub_category": "61f84cf43c4594f1d2f692c7"
  },
  {
    "i": 35,
    "title": "Decode and Conquer",
    "author": "Lewis C. Lin",
    "cover": "https://images-na.ssl-images-amazon.com/images/I/41kgmZHD68L._SY291_BO1,204,203,200_QL40_FMwebp_.jpg",
    "overview": "Lewis C. Lin — the world's #1 expert on product management (PM) interviews — has updated Decode and Conquer in an all-new fourth edition. Decode and Conquer is your starting point on how to conquer the most difficult PM interview questions.",
    "description": "I am a Zimbabwean who has been living in China for the last 8 years. No direct PM experience but your 2-week PM guide has been incredibly useful. I have also been reading Decode and Conquer which has gotten me up to speed really fast. Brilliant book! I have just about finished your book Decode and Conquer and have found it to be enlightening. I feel that I already have drastically reduced the amount of PM interviews that I would have failed with a deer in the headlights look on my face. Lewis Lin is the best. Just heard back from Uber, it’s a yes! 🙏 I had interviewed there twice before over the years, but it wasn’t until I encountered Lewis, his materials, and this community that I was finally able to crack it.",
    "publisher": "Independently published",
    "publication_date": "January 13, 2022",
    "language": "en",
    "pages_count": 216,
    "last_price": 31,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 3,
    "category": "61f84eb1dc1d9702913a4398",
    "sub_category": "61f84cf43c4594f1d2f692aa"
  },
  {
    "i": 0,
    "title": "",
    "author": "",
    "cover": "",
    "overview": "",
    "description": "",
    "publisher": "",
    "publication_date": "",
    "language": "en",
    "pages_count": 0,
    "last_price": 0,
    "discount": 0,
    "quantity": 1000,
    "average_rating": 5,
    "tags": [],
    "category": "",
    "sub_category": ""
  }
]
